# Advanced Dataframes

Use your function to obtain a connection to the employees database.

In [16]:
import pandas as pd
import env # contains database access

Read the employees and titles tables into two separate DataFrames.

In [2]:
query = """
SELECT *
FROM employees;
"""

emp_data = pd.read_sql(query, env.get_db_access())
emp_data.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

Tittles dataframe

In [3]:
query = """
SELECT *
FROM titles;
"""

titles_data = pd.read_sql(query, env.get_db_access())
titles_data.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

How many rows and columns do you have in each DataFrame? Is that what you expected?

In [7]:
emp_data.shape

(300024, 6)

In [9]:
titles_data.shape

(443308, 4)

Display the summary statistics for each DataFrame.

In [4]:
emp_data.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [5]:
titles_data.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

How many unique titles are in the titles DataFrame?

In [10]:
titles_data.nunique()

emp_no       300024
title             7
from_date      6393
to_date        5888
dtype: int64

In [12]:
titles_data.title.nunique()

7

What is the oldest date in the to_date column?

In [17]:
titles_data.to_date.min()

datetime.date(1985, 3, 1)

What is the most recent date in the to_date column?

In [14]:
titles_data.to_date.max()

datetime.date(9999, 1, 1)